"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""

def main():
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
    phone_sales = [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
    ]
    total_sum = 0
    total_average = 0

    def total_sales(period_sale):
        total_phone_sum = 0
        for period_sum in period_sale:
            total_phone_sum += period_sum
        return total_phone_sum
    
    for phone_model in phone_sales:
        phone_sum = total_sales(phone_model['items_sold'])
        phone_average = phone_sum / len(phone_model['items_sold'])
        print(f'Модель телефона {phone_model["product"]} общие продажи {phone_sum} средние продажи {phone_average}')
        total_sum += phone_sum
        total_average += phone_average
    
    print(f'Общие продажи {total_sum}')
    print(f'Общее среднее {total_average / len(phone_sales)}')

if __name__ == "__main__":
    main()
